{
	"program_info": {
		"title": "COST Training 4.0",
		"subtitle": "Developing 9 Central Habits of Following Jesus",
		"description": "COST groups consist of 2-4 people of the same gender committed to growing together as they pursue Jesus and His plan for their lives.",
		"duration": "Minimum 10 weeks",
		"format": "Small group training",
		"acronym": {
			"C": "CONNECT - Build relationships with God and others",
			"O": "OBEY - Love through time, talent, and treasure",
			"S": "SHARE - Spread the good news in word and action",
			"T": "TRAIN - Multiply Jesus' movement"
		}
	},
	"principles": [
		"Not about Perfection, but Priority, Process, and Progression",
		"Less about will power and more about making room",
		"Transformation comes from Transparency",
		"Eternity Reframes Everything"
	],
	"sections": {
		"relationship": {
			"section_number": 1,
			"title": "The Habit of Relationship",
			"core_habit": "Spend the first hour of your morning alone with God",
			"overview": "A.W. Tozer wrote, 'What comes into our minds when we think about God is the most important thing about us.' If this is true, then the biggest problem in your life is not your finances, your job, or your relationships. Your biggest problem is an unhealthy relationship with God. As the Author of existence and the source of all good things, He alone can fulfill the longings within us and direct our steps to all that is life-giving. But only if we allow Him the space to do so. Brother Lawrence, a 17th century monk, said, 'All spiritual life consists of practicing God's presence, and that anyone who practices it correctly will soon attain spiritual fulfillment.' The challenge with loving God is that He is not like anyone else you know. To actually love Him, you must practice giving your full attention to Him and methodically reprogram your thoughts about Him and your desires for Him. This is why daily time alone, seeking God, is one of the most crucial habits in your life.",
			"implementation": "The habit of seeking God has four important elements: time, attention, the Bible, and prayer. First, you must set aside time to seek God. If this is a new habit for you, begin by setting aside the first 15 minutes of your day's full attention for God. If you have practiced this habit for a while, target one hour every morning. One hour is long enough to completely disrupt your routine but short enough to actually be possible with some sacrifice.",
			"soap_method": {
				"description": "Approaching your time with God by meditating on His word, the Bible, can be a little intimidating, especially if this is new for you. Here is a very simple approach to help get the most out of your first hour with God. We call it S.O.A.P., which stands for Scripture, observe, apply, pray. Through journaling, read Scripture, and process through its truths, how it applies to you, and use it as a prayer guide to talk with God. Like a good shower, there's nothing like starting your day fresh, setting the tone in God's presence.",
				"S": "SCRIPTURE (what passage am I reading?)",
				"O": "OBSERVE (what does this say about God's heart and the original audience?)",
				"A": "APPLY (what is God saying to me, personally?)",
				"P": "PRAY (how can I bring this to Jesus?)"
			},
			"meeting": {
				"title": "Knowing God",
				"scripture": "John 15:1-17",
				"introduction": "Jesus uses the imagery of a vine and branches. What is so powerful about this imagery and what does this reveal about why God wants to be so connected to us through Jesus?",
				"key_concepts": [
					"Remaining in Jesus is essential for spiritual fruit",
					"Pruning leads to greater fruitfulness",
					"Daily time with God builds relationship",
					"Long-term reward vs. immediate gratification"
				],
				"discussion_points": [
					"What is so powerful about this imagery and what does this reveal about why God wants to be so connected to us through Jesus?",
					"What is at stake if we do not remain connected to Jesus?",
					"Jesus speaks of a number of rewards God is longing to give us if we remain in him and obey his commands. Which ones did you see?",
					"What does He want for us?",
					"What are the essential elements of being close to God in this passage?",
					"What difference would it make to our kingdom contribution in the world if we consistently developed a deepening relationship with Jesus?",
					"If you really believed that there was infinite, limitless joy offered to you on the other side of developing a close relationship with God every day, what would you change about your routine to pursue that?",
					"What would it look like for you to develop a daily habit of seeking God alone?"
				]
			}
		},
		"rhythm": {
			"section_number": 2,
			"title": "The Habit of Rhythm",
			"core_habit": "Develop weekly rhythms to be healthy emotionally, mentally, and physically",
			"overview": "The faith world is often not a place where holistic health is considered. We hear a lot about getting your heart and soul right with God, but what about the rest of you? Inadvertently, our emphasis on the soul and our eternal reality, has often done injustice to the whole person God created by separating the value of our soul from our body. Quite literally, we can be 'so heavenly minded, that we're no earthly good.' But God has created this whole physical world 'very good' and designed us to worship him with our entire selves, mind, body, soul, and spirit (see Mark 12:30).",
			"holistic_principle": "Because we are holistic and multifaceted beings, how we live in one area of our self will have an impact on every other area. We cannot be fully healthy in one area if we are not healthy in the others. Your IQ in bible knowledge may be high, but that does not mean you know how to control your anger. Quite honestly, poor emotional health will negatively impact how you see the world and interpret truth. Similarly, if we are not physically healthy, we will struggle with the energy to care for people. We cannot separate one aspect of our self from the others. We are integrated self—mind, soul, emotions, and body. God designed us to worship him by being healthy in every area of our life.",
			"health_circles": {
				"description": "3 Circles of Health"
			},
			"meeting": {
				"title": "Holistic Health",
				"scripture": "Mark 12:30",
				"introduction": "Why do you think God created us multifaceted beings designed to thrive only when all four areas are healthy?",
				"key_concepts": [
					"Holistic worship involves heart, soul, mind, and strength",
					"All four areas of health impact each other",
					"Mental renewal through God's word and good books",
					"Emotional honesty and processing with God and others",
					"Physical discipline honors God's temple"
				],
				"discussion_points": [
					"Why do you think God created us multifaceted beings designed to thrive only when all four areas are healthy?",
					"What does this communicate about our human condition and God's heart for us?",
					"Do you agree that we cannot be fully healthy if one area is not healthy?",
					"How have you seen these four aspects of the self impacting each other for good or bad?",
					"Is it uncomfortable for you to talk about getting healthy in any one of these four areas? If so, why?",
					"Where are you strongest? Where are you weakest?",
					"Do you adequately take care of your body, your emotions and your mind?",
					"What's at stake if we do not take this seriously? And what next steps can you take this week to get healthier?"
				]
			}
		},
		"reconciliation": {
			"section_number": 3,
			"title": "The Habit of Reconciliation",
			"core_habit": "Commit to gathering weekly with believers in large and small groups",
			"overview": "God did not design us to live life in isolation. There is a reason solitary confinement is one of the harshest punishments. God created us to thrive in a committed, sacrificial, and caring circle of relationships as we live on mission together. Yet, our modern Western world has conditioned us more towards isolation and loneliness than ever before. Each decade, the average number of reported close friends continues to decline, with over half of Americans feeling regularly lonely and as many as 40% feeling chronically lonely. Even for all the digital 'friends' and connections through 'social' media and other virtual opportunities, stats show a sharp decline in meaningful, secure attachments in relationships. Great Britain even has a 'loneliness minister' to attend to this Western crisis!",
			"church_context": "The church is not void of this trend either. Church attendance has dropped all across the Western world. Even those who merely attend church, without meaningful connections throughout the week, tend to do so less often. Bottom line: we live in a culture with many lonely and disconnected people. But Jesus calls us to something higher. His context for personal transformation is community. And not just any community, but a radical community committed to sharing life at deep, sacrificial levels. This is the alternative community Jesus envisioned and gave his life for to utterly change the world.",
			"radical_community": "With this in mind, our third COST habit must follow Jesus into His rhythms of life together. There is no other way to experience Jesus' abundant life fully without intentionally choosing to live His kind of life together with others who are also following Him. To become love, we must embrace the fact that love has a context: relationships. For those who say, 'Who needs the church? I can practice my faith on my own,' they have missed the core of what it means to become love. We cannot practice love without community.",
			"meeting": {
				"title": "Life Together",
				"scripture": "Acts 2:36-47",
				"introduction": "The early church had some incredibly counter-cultural practices that had a deeply shaping effect upon their growing movement and surrounding communities.",
				"key_concepts": [
					"Transformation happens in community",
					"Large and small group gatherings are essential",
					"Confession and accountability with others",
					"Forgiveness as a community practice",
					"Deep friendship and laying down lives for each other"
				],
				"discussion_points": [
					"What rhythms of life together do you see the early church practicing in this passage?",
					"What was it about Peter's Gospel message that inspired the early church to live this way?",
					"What did it cost these believers to share life at the level that they did? Why do you think they embraced that cost?",
					"How did these rhythms together shape these believers, individually and communally?",
					"What would it take for our modern churches to embrace a similar way of 'life together?' How would it look different?",
					"What barriers do we need to overcome?",
					"What if we took this seriously? How would our lives, our churches, and our communities change as a result?"
				]
			}
		},
		"radiance": {
			"section_number": 4,
			"title": "The Habit of Radiance",
			"core_habit": "Share your faith every week",
			"overview": "Most of us love comfort. We want comfortable clothes, comfortable furniture, and comfortable conversations. We even prefer comfort foods. Comfort has become such a priority in our culture that it deeply influences what we are willing to think or talk about. Although there is not necessarily anything wrong with outward comforts, Jesus calls us higher. Combine this with a cultural pressure to keep faith a private deal—'believe whatever you want, just don't force it on me'—and it leaves many hesitant to share their faith with others.",
			"cultural_statistics": "In fact, only half of Christians have more than two conversations about faith each year, and 38% of adults identifying as Christians do not have a friend or family member who does not identify as a Christian. But this is not the way of Jesus! As you grow in the first few habits, you will likely discover God's love compelling you to share His love with others.",
			"spirit_compulsion": "You will find yourself interacting with others who are far from God, and the Spirit of Jesus will tug on your soul. How can you stand by and say nothing? How can you watch your friend or your neighbor struggle without a living relationship with God? As God's love grows within you, it will push you beyond what is comfortable. But, how do you effectively share your faith? How do you engage those around you in spiritual conversations? There is no perfect method, but there is a perfect motive. It must begin with love.",
			"practical_approach": "Out of a heart of love, you can grow in sharing your faith every week. You might read this and think, 'Share my faith once a week? Are you serious? I don't share my faith once a year!' Maybe this seems unrealistic right now, but let me assure you, you can do this. Start moving out in this direction and God will meet you, opening unexpected doors and standing with you even when you feel unqualified. As you learn to pray for those in your sphere of influence who do not yet believe, listen well, share time with them, and serve them, God will open doors to share the hope of Jesus and His work of grace in your life.",
			"meeting": {
				"title": "Learning to Share",
				"scripture": "1 Corinthians 9:16, 19-23 and Romans 10:8-15",
				"introduction": "What was it about Paul's understanding of Jesus' love that compelled Paul to make himself a 'slave' to win people?",
				"key_concepts": [
					"Compelled by Christ's love to serve others",
					"Cultural resistance to servant leadership",
					"The urgency of sharing the Gospel",
					"Building relationships through prayer, listening, and serving",
					"The power of personal testimony"
				],
				"discussion_points": [
					"What was it about Paul's understanding of Jesus' love that compelled Paul to make himself a 'slave' to win people?",
					"What do you think that looked like on a daily basis?",
					"Have you also felt compelled deep in your soul to help others find this hope in Jesus?",
					"How does our culture of 'do whatever makes you happy' lead us to resist Paul's example?",
					"What is at stake if we do not share the good news of Jesus with our words?",
					"Is there a good enough reason to keep our faith to ourselves?",
					"What do we miss out on if we do not share our faith?",
					"Can you think of a time when you effectively shared your faith? What happened?",
					"How did sharing your faith impact your passion for Jesus?"
				]
			}
		},
		"response": {
			"section_number": 5,
			"title": "The Habit of Response",
			"core_habit": "Serve someone daily and your church twice a month",
			"overview": "Serving others is not a side project of the Christian life — it is the Christian life. From Genesis to Revelation, the arc of Scripture reveals a God who stoops to serve, culminating in the sacrificial love of Jesus Christ. When we serve others, we are not merely doing good; we are embodying the very heart of the gospel. First, serving others is a biblical priority. Jesus taught His disciples that greatness in the kingdom is not measured by position, but by posture — the posture of a servant. In John 13, when Jesus washed the disciples' feet, He said plainly, 'I have set you an example that you should do as I have done for you' (v.15). In that moment, He shattered every hierarchy and made service the defining mark of His followers.",
			"gospel_response": "Second, serving is our faithful response to Jesus' sacrifice for us. The gospel is not just something we believe; it's something we become. Jesus didn't just save us from something — He saved us for something. His humility and love compel us, as 2 Corinthians 5:14 puts it, to 'no longer live for ourselves but for him who died for us.' Third, serving others is a credible witness to the world. In an age obsessed with self, service stands out. Jesus said in John 13:35, 'By this everyone will know that you are my disciples, if you love one another.' When love becomes visible through service, it points others to the invisible Savior.",
			"real_difference": "Finally, serving others makes a real difference. Galatians 5:13 calls us to 'serve one another humbly in love,' and when we do, we become living proof that God's kingdom is already breaking into the world. Service lifts the lowly, meets needs, binds wounds, and offers hope. It changes the world, one act of obedience at a time.",
			"stott_quote": "As John Stott put it: 'The authority by which the Christian leader leads is not power but love, not force but example, not coercion but reasoned persuasion. Leaders have power, but power is safe only in the hands of those who humble themselves to serve.' In a world hungry for meaning and desperate for hope, there may be no louder sermon than a life laid down in love. To follow Jesus is to follow Him to the basin and the towel — and from there, to the lives of others.",
			"meeting": {
				"title": "Every Gift",
				"scripture": "1 Corinthians 12:4-31",
				"introduction": "Reflect on the image of a body with many parts. What is the overall picture Paul is painting about the various gifts God has given us and their purpose?",
				"key_concepts": [
					"Every person has unique gifts from God",
					"Gifts are for serving others, not personal recognition",
					"Stewardship vs. ownership of abilities",
					"Service as response to Christ's love",
					"Authentic faith revealed through action"
				],
				"discussion_points": [
					"What is the overall picture Paul is painting about the various gifts God has given us and their purpose?",
					"Why do you think God made us so different and dependent on each other?",
					"What happens when not everyone is using their gift?",
					"What is the danger of 'gift comparison?' What warnings do you see in this passage?",
					"Paul clarifies that no one is a mistake - 'God has placed the parts in the body, every one of them, just as he wanted them to be.' Is this easy or hard to accept?",
					"What do you think your unique gift could be?",
					"What's a next step you could take to activate it on a regular basis?"
				]
			}
		},
		"resistance": {
			"section_number": 6,
			"title": "The Habit of Resistance",
			"core_habit": "Connect weekly with an accountability partner to set boundaries, resist temptations and replace them with living by God's design",
			"overview": "In our culture, we are bombarded with the narrative of self-fulfillment at all costs. 'Do whatever makes you happy' and 'follow your heart,' are common phrases. This is how our culture defines true freedom: the absence of constraints to pursue happiness for your authentic self. Yet if we follow the path of 'I'm free to do whatever I want,' and never resist our desires, will it actually lead us to the happiness we are longing for? The reality is that our desires, unchecked, will always lead us astray. Unrestrained desire for food will leave us physically unhealthy. Unrestrained desire for digital feedback on mobile devices will leave us addicted and not present. And unrestrained sexual desires will inevitably lead to regret and shame.",
			"spiritual_resistance": "So what's our solution? Spiritual resistance. The Bible calls it self-control, a mastery of the self and our desires, submitting them to Jesus and learning how to say 'no' to lesser desires to find true fulfillment in Jesus alone. Tim Keller once said, 'Real freedom comes from a strategic loss of some freedoms in order to gain others. It is not the absence of constraints but it is the choosing the right constraints and the right freedoms to lose.'",
			"cost_of_discipleship": "This does not mean it will be easy. Dietrich Bonhoeffer once said, 'When Christ calls a man, he bids him come and die.' Yes, the cost of discipleship is a high bar, but have we considered the cost of non-discipleship? If we do not have a way of resisting our immediate urges, the cost of not following Jesus will always be harder, leaving us more enslaved than before. God's plan for us is not to restrict, but to give life. But we must embrace His boundaries through self-control if we are to truly experience this life.",
			"accountability_necessity": "Here's the key: you cannot do this on your own! We're too selfish to see our own blindspots and too weak to will ourselves into obedience. That's where accountability comes in. To practice the habit of resistance, we all have to not only identify our temptations and unhealthy addictions, but develop regular accountability relationships in our lives to help us resist.",
			"meeting": {
				"title": "Self-Control",
				"scripture": "Titus 2:11-14",
				"introduction": "How do we encounter the love of God in this passage? What is He offering us as He invites us to live a life of resistance?",
				"key_concepts": [
					"Grace empowers us to say no to ungodliness",
					"Self-control requires replacing temptations with higher purposes",
					"Sexual purity and God's design for sexuality",
					"Confession and accountability break sin's power",
					"Resurrection power enables new desires"
				],
				"discussion_points": [
					"How do we encounter the love of God in this passage?",
					"What did Jesus have to say 'no' to in order to offer us salvation?",
					"How does His example empower us to live self-controlled lives?",
					"What newfound capacity does the grace of Jesus give us to overcome temptation?",
					"How did this greater 'yes' empower Paul to say 'no' to lesser temptations?",
					"What higher 'yes' would empower you to say a thousand 'no's'?",
					"How does self-control shape our character and help us become people who are 'eager to do what is good'?",
					"What do you need to resist this week?"
				]
			}
		},
		"resources": {
			"section_number": 7,
			"title": "The Habit of Resources",
			"core_habit": "Structure your stewardship around priority, percentage, and progressive giving",
			"overview": "What makes you feel secure? What makes you feel important? What gives you a sense of control? For many of us, there is one thing that informs our sense of security, our sense of worth, and our feeling of control: money. According to Scripture, having money is not sin. Money provides certain opportunities, and can be a great tool in God's hand. What is dangerous is a reliance on money, treating it as a false salvation. Those with any degree of wealth will inevitably struggle with the mirage of self-sufficiency and security (See Mark 10:17-27).",
			"stewardship_mindset": "How do we live free from an unhealthy attachment to money, and instead, develop healthy attachments to God? First, we must change how we see ourselves. We are not owners of our life and things. We are stewards, entrusted by God to help manage the life and resources He has given us for His purposes. In this, we must learn to trust Him with our money through priority giving, percentage giving, and progressive giving.",
			"giving_principles": {
				"priority_giving": "Priority Giving: God teaches us to trust him by commanding us to give our first and our best (Matthew 6:33). When we give last, after all the bills are paid and the needs are met, there is no faith involved in the transaction. But when we give first, before any of our needs are met, we declare God as our source, our safety, and our provider!",
				"percentage_giving": "Percentage Giving: Generosity looks different for every person (see the woman and her copper coins in the temple in Luke 21:1–4). Each person must wrestle with the question, 'How much would I have to give in order to detach my heart from trusting in things and attach my heart fully to God?' Scripture introduces the principle of the tithe (giving 10 percent of my income) as a starting place to teach our hearts to trust him.",
				"progressive_giving": "Progressive Giving: Like all areas in your spiritual life, God wants you to grow and stretch over time. Progressive giving means that you regularly assess your standard of living and your standard of giving, inviting God into the assessment and allowing your heart to stay in a place of dependence and faith. This leads to the seventh COST Habit."
			},
			"meeting": {
				"title": "Do I Really Trust?",
				"scripture": "Matthew 6:19-34",
				"introduction": "Jesus talks about the difference between earthly or heavenly treasure. How do you see Jesus redirecting our hearts when it comes to where we find our security?",
				"key_concepts": [
					"Heart follows treasure - money reveals our values",
					"Generosity as antidote to anxiety",
					"Stewardship vs. ownership mentality",
					"Priority, percentage, and progressive giving",
					"Contentment vs. love of money"
				],
				"discussion_points": [
					"How do you see Jesus redirecting our hearts when it comes to where we find our security?",
					"How is the management of money connected to our hearts?",
					"How is generosity a counter-intuitive antidote to anxiety?",
					"How does God change us through generosity?",
					"What are your biggest concerns as your COST group begins a discussion about money?",
					"Have you struggled trying to find or build your sense of safety and security from money?",
					"When it comes to money, do you feel more like an owner or a steward?",
					"How has your relationship with God influenced your thinking in this area?",
					"In what ways are you ready for God to grow you in the area of stewardship?"
				]
			}
		},
		"refuel": {
			"section_number": 8,
			"title": "The Habit of Refuel",
			"core_habit": "Practice living by grace through a weekly Sabbath routine",
			"meeting": {
				"title": "Changing Your Pace & Identity",
				"scripture": "Deuteronomy 5:12-14",
				"introduction": "Given that God gave these words to people who had only known 400 years of slavery, what would these words have communicated about who they were and their true value?",
				"key_concepts": [
					"Identity comes from being, not doing",
					"God rested to model rhythm for creation",
					"Sabbath breaks the slavery of constant productivity",
					"Rest and delight as acts of faith and self-denial",
					"Moving from restlessness to restfulness"
				],
				"discussion_points": [
					"What would these words have communicated to former slaves about who they were and where their true value came from?",
					"How significant is it that we find God resting on the seventh day?",
					"What did God want His creation to know about where we derive our identity and sense of worth?",
					"Do you sense the cultural pressure towards constant busyness to validate your personal value?",
					"Do you find yourself uneasy about turning off all work, busyness and even your phone for 24 hours?",
					"What comes to mind when you hear the word 'Sabbath'?",
					"How was Sabbath intended to be different from a day off?",
					"What is the value of God commanding us to practice Sabbath?",
					"What changes would you have to make to truly practice the rest and delight of the Sabbath?"
				]
			}
		},
		"replication": {
			"section_number": 9,
			"title": "The Habit of Replication",
			"core_habit": "Build an intentional circle of discipleship",
			"meeting": {
				"title": "Called to Disciple",
				"scripture": "Matthew 28:18-20",
				"introduction": "As Jesus challenged His followers to 'go and make disciples,' what qualified them to do so? And how is that an encouragement to you?",
				"key_concepts": [
					"Every Christian is called to make disciples",
					"Jesus chose character over qualifications",
					"Spiritual growth hits a ceiling without discipleship",
					"Leading by example, not just words",
					"Passing faith through generations like Timothy's family"
				],
				"discussion_points": [
					"As Jesus challenged His followers to 'go and make disciples,' what qualified them to do so?",
					"What did Jesus promise to His disciple-makers? What difference does that make?",
					"Do you see yourself as a disciple-maker? Why or why not?",
					"What is your experience of intentionally helping others follow Jesus?",
					"Are you willing to help train others?",
					"Do you think Jesus intentionally chose character over qualifications?",
					"What would need to change for you to take this command more seriously?",
					"What's one step you can take to make that change this week?"
				]
			}
		}
	}
}
