{
  "program_info": {
    "title": "COST Training 4.0",
    "subtitle": "Developing 9 Central Habits of Following Jesus",
    "description": "COST groups consist of 2-4 people of the same gender committed to growing together as they pursue Jesus and His plan for their lives.",
    "duration": "Minimum 10 weeks",
    "format": "Small group training",
    "acronym": {
      "C": "CONNECT - Build relationships with God and others",
      "O": "OBEY - Love through time, talent, and treasure",
      "S": "SHARE - Spread the good news in word and action", 
      "T": "TRAIN - Multiply Jesus' movement"
    }
  },
  "principles": [
    "Not about Perfection, but Priority, Process, and Progression",
    "Less about will power and more about making room",
    "Transformation comes from Transparency"
  ],
  "sections": {
    "relationship": {
      "section_number": 1,
      "title": "The Habit of Relationship",
      "core_habit": "Spend the first hour of your morning alone with God",
      "meeting": {
        "title": "Knowing God",
        "scripture": "John 15:1-17",
        "introduction": "Jesus uses the imagery of a vine and branches. What is so powerful about this imagery and what does this reveal about why God wants to be so connected to us through Jesus?",
        "key_concepts": [
          "Remaining in Jesus is essential for spiritual fruit",
          "Pruning leads to greater fruitfulness",
          "Daily time with God builds relationship",
          "Long-term reward vs. immediate gratification"
        ],
        "discussion_points": [
          "What is so powerful about this imagery and what does this reveal about why God wants to be so connected to us through Jesus?",
          "What is at stake if we do not remain connected to Jesus?",
          "Jesus speaks of a number of rewards God is longing to give us if we remain in him and obey his commands. Which ones did you see?",
          "What does He want for us?",
          "What are the essential elements of being close to God in this passage?",
          "What difference would it make to our kingdom contribution in the world if we consistently developed a deepening relationship with Jesus?",
          "If you really believed that there was infinite, limitless joy offered to you on the other side of developing a close relationship with God every day, what would you change about your routine to pursue that?",
          "What would it look like for you to develop a daily habit of seeking God alone?"
        ]
      }
    },
    "rhythm": {
      "section_number": 2,
      "title": "The Habit of Rhythm",
      "core_habit": "Develop weekly rhythms to be healthy emotionally, mentally, and physically",
      "meeting": {
        "title": "Holistic Health",
        "scripture": "Mark 12:30",
        "introduction": "Why do you think God created us multifaceted beings designed to thrive only when all four areas are healthy?",
        "key_concepts": [
          "Holistic worship involves heart, soul, mind, and strength",
          "All four areas of health impact each other",
          "Mental renewal through God's word and good books",
          "Emotional honesty and processing with God and others",
          "Physical discipline honors God's temple"
        ],
        "discussion_points": [
          "Why do you think God created us multifaceted beings designed to thrive only when all four areas are healthy?",
          "What does this communicate about our human condition and God's heart for us?",
          "Do you agree that we cannot be fully healthy if one area is not healthy?",
          "How have you seen these four aspects of the self impacting each other for good or bad?",
          "Is it uncomfortable for you to talk about getting healthy in any one of these four areas? If so, why?",
          "Where are you strongest? Where are you weakest?",
          "Do you adequately take care of your body, your emotions and your mind?",
          "What's at stake if we do not take this seriously? And what next steps can you take this week to get healthier?"
        ]
      }
    },
    "reconciliation": {
      "section_number": 3,
      "title": "The Habit of Reconciliation",
      "core_habit": "Commit to gathering weekly with believers in large and small groups",
      "meeting": {
        "title": "Life Together",
        "scripture": "Acts 2:36-47",
        "introduction": "The early church had some incredibly counter-cultural practices that had a deeply shaping effect upon their growing movement and surrounding communities.",
        "key_concepts": [
          "Transformation happens in community",
          "Large and small group gatherings are essential",
          "Confession and accountability with others",
          "Forgiveness as a community practice",
          "Deep friendship and laying down lives for each other"
        ],
        "discussion_points": [
          "What rhythms of life together do you see the early church practicing in this passage?",
          "What was it about Peter's Gospel message that inspired the early church to live this way?",
          "What did it cost these believers to share life at the level that they did? Why do you think they embraced that cost?",
          "How did these rhythms together shape these believers, individually and communally?",
          "What would it take for our modern churches to embrace a similar way of 'life together?' How would it look different?",
          "What barriers do we need to overcome?",
          "What if we took this seriously? How would our lives, our churches, and our communities change as a result?"
        ]
      }
    },
    "radiance": {
      "section_number": 4,
      "title": "The Habit of Radiance",
      "core_habit": "Share your faith every week",
      "meeting": {
        "title": "Learning to Share",
        "scripture": "1 Corinthians 9:16, 19-23 and Romans 10:8-15",
        "introduction": "What was it about Paul's understanding of Jesus' love that compelled Paul to make himself a 'slave' to win people?",
        "key_concepts": [
          "Compelled by Christ's love to serve others",
          "Cultural resistance to servant leadership",
          "The urgency of sharing the Gospel",
          "Building relationships through prayer, listening, and serving",
          "The power of personal testimony"
        ],
        "discussion_points": [
          "What was it about Paul's understanding of Jesus' love that compelled Paul to make himself a 'slave' to win people?",
          "What do you think that looked like on a daily basis?",
          "Have you also felt compelled deep in your soul to help others find this hope in Jesus?",
          "How does our culture of 'do whatever makes you happy' lead us to resist Paul's example?",
          "What is at stake if we do not share the good news of Jesus with our words?",
          "Is there a good enough reason to keep our faith to ourselves?",
          "What do we miss out on if we do not share our faith?",
          "Can you think of a time when you effectively shared your faith? What happened?",
          "How did sharing your faith impact your passion for Jesus?"
        ]
      }
    },
    "response": {
      "section_number": 5,
      "title": "The Habit of Response",
      "core_habit": "Serve someone daily and your church twice a month",
      "meeting": {
        "title": "Every Gift",
        "scripture": "1 Corinthians 12:4-31",
        "introduction": "Reflect on the image of a body with many parts. What is the overall picture Paul is painting about the various gifts God has given us and their purpose?",
        "key_concepts": [
          "Every person has unique gifts from God",
          "Gifts are for serving others, not personal recognition",
          "Stewardship vs. ownership of abilities",
          "Service as response to Christ's love",
          "Authentic faith revealed through action"
        ],
        "discussion_points": [
          "What is the overall picture Paul is painting about the various gifts God has given us and their purpose?",
          "Why do you think God made us so different and dependent on each other?",
          "What happens when not everyone is using their gift?",
          "What is the danger of 'gift comparison?' What warnings do you see in this passage?",
          "Paul clarifies that no one is a mistake - 'God has placed the parts in the body, every one of them, just as he wanted them to be.' Is this easy or hard to accept?",
          "What do you think your unique gift could be?",
          "What's a next step you could take to activate it on a regular basis?"
        ]
      }
    },
    "resistance": {
      "section_number": 6,
      "title": "The Habit of Resistance",
      "core_habit": "Connect weekly with an accountability partner to set boundaries, resist temptations and replace them with living by God's design",
      "meeting": {
        "title": "Self-Control",
        "scripture": "Titus 2:11-14",
        "introduction": "How do we encounter the love of God in this passage? What is He offering us as He invites us to live a life of resistance?",
        "key_concepts": [
          "Grace empowers us to say no to ungodliness",
          "Self-control requires replacing temptations with higher purposes",
          "Sexual purity and God's design for sexuality",
          "Confession and accountability break sin's power",
          "Resurrection power enables new desires"
        ],
        "discussion_points": [
          "How do we encounter the love of God in this passage?",
          "What did Jesus have to say 'no' to in order to offer us salvation?",
          "How does His example empower us to live self-controlled lives?",
          "What newfound capacity does the grace of Jesus give us to overcome temptation?",
          "How did this greater 'yes' empower Paul to say 'no' to lesser temptations?",
          "What higher 'yes' would empower you to say a thousand 'no's'?",
          "How does self-control shape our character and help us become people who are 'eager to do what is good'?",
          "What do you need to resist this week?"
        ]
      }
    },
    "resources": {
      "section_number": 7,
      "title": "The Habit of Resources",
      "core_habit": "Structure your stewardship around priority, percentage, and progressive giving",
      "meeting": {
        "title": "Do I Really Trust?",
        "scripture": "Matthew 6:19-34",
        "introduction": "Jesus talks about the difference between earthly or heavenly treasure. How do you see Jesus redirecting our hearts when it comes to where we find our security?",
        "key_concepts": [
          "Heart follows treasure - money reveals our values",
          "Generosity as antidote to anxiety",
          "Stewardship vs. ownership mentality",
          "Priority, percentage, and progressive giving",
          "Contentment vs. love of money"
        ],
        "discussion_points": [
          "How do you see Jesus redirecting our hearts when it comes to where we find our security?",
          "How is the management of money connected to our hearts?",
          "How is generosity a counter-intuitive antidote to anxiety?",
          "How does God change us through generosity?",
          "What are your biggest concerns as your COST group begins a discussion about money?",
          "Have you struggled trying to find or build your sense of safety and security from money?",
          "When it comes to money, do you feel more like an owner or a steward?",
          "How has your relationship with God influenced your thinking in this area?",
          "In what ways are you ready for God to grow you in the area of stewardship?"
        ]
      }
    },
    "refuel": {
      "section_number": 8,
      "title": "The Habit of Refuel",
      "core_habit": "Practice living by grace through a weekly Sabbath routine",
      "meeting": {
        "title": "Changing Your Pace & Identity",
        "scripture": "Deuteronomy 5:12-14",
        "introduction": "Given that God gave these words to people who had only known 400 years of slavery, what would these words have communicated about who they were and their true value?",
        "key_concepts": [
          "Identity comes from being, not doing",
          "God rested to model rhythm for creation", 
          "Sabbath breaks the slavery of constant productivity",
          "Rest and delight as acts of faith and self-denial",
          "Moving from restlessness to restfulness"
        ],
        "discussion_points": [
          "What would these words have communicated to former slaves about who they were and where their true value came from?",
          "How significant is it that we find God resting on the seventh day?",
          "What did God want His creation to know about where we derive our identity and sense of worth?",
          "Do you sense the cultural pressure towards constant busyness to validate your personal value?",
          "Do you find yourself uneasy about turning off all work, busyness and even your phone for 24 hours?",
          "What comes to mind when you hear the word 'Sabbath'?",
          "How was Sabbath intended to be different from a day off?",
          "What is the value of God commanding us to practice Sabbath?",
          "What changes would you have to make to truly practice the rest and delight of the Sabbath?"
        ]
      }
    },
    "replication": {
      "section_number": 9,
      "title": "The Habit of Replication", 
      "core_habit": "Build an intentional circle of discipleship",
      "meeting": {
        "title": "Called to Disciple",
        "scripture": "Matthew 28:18-20",
        "introduction": "As Jesus challenged His followers to 'go and make disciples,' what qualified them to do so? And how is that an encouragement to you?",
        "key_concepts": [
          "Every Christian is called to make disciples",
          "Jesus chose character over qualifications",
          "Spiritual growth hits a ceiling without discipleship",
          "Leading by example, not just words",
          "Passing faith through generations like Timothy's family"
        ],
        "discussion_points": [
          "As Jesus challenged His followers to 'go and make disciples,' what qualified them to do so?",
          "What did Jesus promise to His disciple-makers? What difference does that make?",
          "Do you see yourself as a disciple-maker? Why or why not?",
          "What is your experience of intentionally helping others follow Jesus?",
          "Are you willing to help train others?",
          "Do you think Jesus intentionally chose character over qualifications?",
          "What would need to change for you to take this command more seriously?",
          "What's one step you can take to make that change this week?"
        ]
      }
    }
  }
}
